Clase-04/4-ArtilleryRun/prueba.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: fase 1
    - duration: 15
      arrivalRate: 5
      rampTo: 10
      name: fase 2

  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions

scenarios:
  - flow:
        - get:
            url: '/test/user'